#include<iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "");
	char code; //операнд для выбора кодирования - шифровка или дешифровка
	cout << "Введите символ:\ne - Зашифровать\nd - Дешифровать" << endl;
	do {
		do {
			cin >> code;
		} while (code != 'e' && code != 'd'); //проверка на корректность введенного символа

		int length{}; //переменная длины строки
		cout << "Введите длину строки" << endl;
		do {
			cin >> length;
		} while (length <= 0); //проверка на корректность ввода длины строки

		char* StrArr = new char[length + 1]; //создание массива символов с указанной длиной
		StrArr[length] = '\0'; //добавляем нулевой символ в конец строки

		cout << "Введите символы английского алфавита с клавиатуры по одному" << endl;

		//ввод символов с клавиатуры
		for (int i{}; i < length; i++) {
			cin >> StrArr[i];

			//проверка на корректность вводимых символов
			if ((StrArr[i] >= 'A' && StrArr[i] <= 'Z') || (StrArr[i] >= 'a' && StrArr[i] <= 'z')) {
				continue;
			}
			else {
				cout << "Символ введен неверно, введите заново" << endl;
				i--;
			}
		}

		int x{}; //переменная сдвига шифра
		cout << "Введите на какое число необходимо сдвигать шифр" << endl;
		cin >> x;

		//инвертируем x если выбрано дешифрование
		if (code == 'd') {
			x = -x;
		}
		//переменная для переноса при выходе за рамки
		int perenos{ 26 };
		if (code == 'e') {
			perenos = -perenos;
		}


		//переходим к шифровке-дешифровке
		for (int i{}; i < length; i++) {

			//проверяем не выходит ли символ за рамки
			if ((StrArr[i] + x) < 65 || ((StrArr[i] + x) > 90 && (StrArr[i] + x) < 97) || ((StrArr[i] + x) > 122)) {
				StrArr[i] += (x + perenos);
			}
			else {
				StrArr[i] += x;
			}
		}
		//выводим массив символов после шифровки-дешифровки
		cout << "Результат:" << endl;
		for (int i{}; i < length; i++) {
			cout << StrArr[i];
		}
		cout << endl;
		//чистим
		delete[] StrArr;
		cout<<"Введите символ e (Зашифровать) или d(Дешифровать), если хотите повторно запустить программу\nДля закрытия программы введите любой другой символ"<<endl;
		cin >> code;
	} while (code == 'e' || code == 'd');
	return 0;
}